; domain
(define (domain elevators_sequencedstrips_p12_3_7-domain)
 (:requirements :strips :typing :numeric-fluents)
 (:types
    elevator passenger count - object
    slow_elevator fast_elevator - elevator
 )
 (:predicates (passenger_at ?person - passenger ?floor - count) (boarded ?person - passenger ?lift - elevator) (lift_at ?lift - elevator ?floor - count) (reachable_floor ?lift - elevator ?floor - count) (above ?floor1 - count ?floor2 - count) (passengers ?lift - elevator ?n - count) (can_hold ?lift - elevator ?n - count) (next ?n1 - count ?n2 - count))
 (:functions (total_cost) (travel_slow ?f1 - count ?f2 - count) (travel_fast ?f1 - count ?f2 - count))
 (:action move_up_slow
  :parameters ( ?lift_0 - slow_elevator ?f1 - count ?f2 - count)
  :precondition (and (lift_at ?lift_0 ?f1) (above ?f1 ?f2) (reachable_floor ?lift_0 ?f2))
  :effect (and (lift_at ?lift_0 ?f2) (not (lift_at ?lift_0 ?f1)) (increase (total_cost) (travel_slow ?f1 ?f2))))
 (:action move_down_slow
  :parameters ( ?lift_0 - slow_elevator ?f1 - count ?f2 - count)
  :precondition (and (lift_at ?lift_0 ?f1) (above ?f2 ?f1) (reachable_floor ?lift_0 ?f2))
  :effect (and (lift_at ?lift_0 ?f2) (not (lift_at ?lift_0 ?f1)) (increase (total_cost) (travel_slow ?f2 ?f1))))
 (:action move_up_fast
  :parameters ( ?lift_1 - fast_elevator ?f1 - count ?f2 - count)
  :precondition (and (lift_at ?lift_1 ?f1) (above ?f1 ?f2) (reachable_floor ?lift_1 ?f2))
  :effect (and (lift_at ?lift_1 ?f2) (not (lift_at ?lift_1 ?f1)) (increase (total_cost) (travel_fast ?f1 ?f2))))
 (:action move_down_fast
  :parameters ( ?lift_1 - fast_elevator ?f1 - count ?f2 - count)
  :precondition (and (lift_at ?lift_1 ?f1) (above ?f2 ?f1) (reachable_floor ?lift_1 ?f2))
  :effect (and (lift_at ?lift_1 ?f2) (not (lift_at ?lift_1 ?f1)) (increase (total_cost) (travel_fast ?f2 ?f1))))
 (:action board
  :parameters ( ?p - passenger ?lift - elevator ?f - count ?n1 - count ?n2 - count)
  :precondition (and (lift_at ?lift ?f) (passenger_at ?p ?f) (passengers ?lift ?n1) (next ?n1 ?n2) (can_hold ?lift ?n2))
  :effect (and (not (passenger_at ?p ?f)) (boarded ?p ?lift) (not (passengers ?lift ?n1)) (passengers ?lift ?n2)))
 (:action leave
  :parameters ( ?p - passenger ?lift - elevator ?f - count ?n1 - count ?n2 - count)
  :precondition (and (lift_at ?lift ?f) (boarded ?p ?lift) (passengers ?lift ?n1) (next ?n2 ?n1))
  :effect (and (passenger_at ?p ?f) (not (boarded ?p ?lift)) (not (passengers ?lift ?n1)) (passengers ?lift ?n2)))
)

; problem
(define (problem elevators_sequencedstrips_p12_3_7-problem)
 (:domain elevators_sequencedstrips_p12_3_7-domain)
 (:objects
   slow0_0 slow1_0 - slow_elevator
   fast0 - fast_elevator
   p0 p1 p2 - passenger
   n0 n1 n2 n3 n4 n5 n6 n7 n8 n9 n10 n11 n12 - count
 )
 (:init (next n0 n1) (next n1 n2) (next n2 n3) (next n3 n4) (next n4 n5) (next n5 n6) (next n6 n7) (next n7 n8) (next n8 n9) (next n9 n10) (next n10 n11) (next n11 n12) (above n0 n1) (above n0 n2) (above n0 n3) (above n0 n4) (above n0 n5) (above n0 n6) (above n0 n7) (above n0 n8) (above n0 n9) (above n0 n10) (above n0 n11) (above n0 n12) (above n1 n2) (above n1 n3) (above n1 n4) (above n1 n5) (above n1 n6) (above n1 n7) (above n1 n8) (above n1 n9) (above n1 n10) (above n1 n11) (above n1 n12) (above n2 n3) (above n2 n4) (above n2 n5) (above n2 n6) (above n2 n7) (above n2 n8) (above n2 n9) (above n2 n10) (above n2 n11) (above n2 n12) (above n3 n4) (above n3 n5) (above n3 n6) (above n3 n7) (above n3 n8) (above n3 n9) (above n3 n10) (above n3 n11) (above n3 n12) (above n4 n5) (above n4 n6) (above n4 n7) (above n4 n8) (above n4 n9) (above n4 n10) (above n4 n11) (above n4 n12) (above n5 n6) (above n5 n7) (above n5 n8) (above n5 n9) (above n5 n10) (above n5 n11) (above n5 n12) (above n6 n7) (above n6 n8) (above n6 n9) (above n6 n10) (above n6 n11) (above n6 n12) (above n7 n8) (above n7 n9) (above n7 n10) (above n7 n11) (above n7 n12) (above n8 n9) (above n8 n10) (above n8 n11) (above n8 n12) (above n9 n10) (above n9 n11) (above n9 n12) (above n10 n11) (above n10 n12) (above n11 n12) (lift_at fast0 n6) (passengers fast0 n0) (can_hold fast0 n1) (can_hold fast0 n2) (can_hold fast0 n3) (reachable_floor fast0 n0) (reachable_floor fast0 n3) (reachable_floor fast0 n6) (reachable_floor fast0 n9) (reachable_floor fast0 n12) (lift_at slow0_0 n6) (passengers slow0_0 n0) (can_hold slow0_0 n1) (can_hold slow0_0 n2) (reachable_floor slow0_0 n0) (reachable_floor slow0_0 n1) (reachable_floor slow0_0 n2) (reachable_floor slow0_0 n3) (reachable_floor slow0_0 n4) (reachable_floor slow0_0 n5) (reachable_floor slow0_0 n6) (lift_at slow1_0 n8) (passengers slow1_0 n0) (can_hold slow1_0 n1) (can_hold slow1_0 n2) (reachable_floor slow1_0 n6) (reachable_floor slow1_0 n7) (reachable_floor slow1_0 n8) (reachable_floor slow1_0 n9) (reachable_floor slow1_0 n10) (reachable_floor slow1_0 n11) (reachable_floor slow1_0 n12) (passenger_at p0 n0) (passenger_at p1 n0) (passenger_at p2 n2) (= (travel_slow n0 n1) 6) (= (travel_slow n0 n2) 7) (= (travel_slow n0 n3) 8) (= (travel_slow n0 n4) 9) (= (travel_slow n0 n5) 10) (= (travel_slow n0 n6) 11) (= (travel_slow n1 n2) 6) (= (travel_slow n1 n3) 7) (= (travel_slow n1 n4) 8) (= (travel_slow n1 n5) 9) (= (travel_slow n1 n6) 10) (= (travel_slow n2 n3) 6) (= (travel_slow n2 n4) 7) (= (travel_slow n2 n5) 8) (= (travel_slow n2 n6) 9) (= (travel_slow n3 n4) 6) (= (travel_slow n3 n5) 7) (= (travel_slow n3 n6) 8) (= (travel_slow n4 n5) 6) (= (travel_slow n4 n6) 7) (= (travel_slow n5 n6) 6) (= (travel_slow n6 n7) 6) (= (travel_slow n6 n8) 7) (= (travel_slow n6 n9) 8) (= (travel_slow n6 n10) 9) (= (travel_slow n6 n11) 10) (= (travel_slow n6 n12) 11) (= (travel_slow n7 n8) 6) (= (travel_slow n7 n9) 7) (= (travel_slow n7 n10) 8) (= (travel_slow n7 n11) 9) (= (travel_slow n7 n12) 10) (= (travel_slow n8 n9) 6) (= (travel_slow n8 n10) 7) (= (travel_slow n8 n11) 8) (= (travel_slow n8 n12) 9) (= (travel_slow n9 n10) 6) (= (travel_slow n9 n11) 7) (= (travel_slow n9 n12) 8) (= (travel_slow n10 n11) 6) (= (travel_slow n10 n12) 7) (= (travel_slow n11 n12) 6) (= (travel_fast n0 n3) 10) (= (travel_fast n0 n6) 19) (= (travel_fast n0 n9) 28) (= (travel_fast n0 n12) 37) (= (travel_fast n3 n6) 10) (= (travel_fast n3 n9) 19) (= (travel_fast n3 n12) 28) (= (travel_fast n6 n9) 10) (= (travel_fast n6 n12) 19) (= (travel_fast n9 n12) 10) (= (total_cost) 0))
 (:goal (and (passenger_at p0 n3) (passenger_at p1 n11) (passenger_at p2 n7)))
 (:metric minimize (total_cost))
)

; plan
1. (move_down_slow slow0_0 n6 n2)
   deleted: (lift_at slow0_0 n6)
   added: (lift_at slow0_0 n2)
   changed: (total_cost) from 0 to 9
   goals met: 0 of 3
2. (move_down_slow slow1_0 n8 n6)
   deleted: (lift_at slow1_0 n8)
   added: (lift_at slow1_0 n6)
   changed: (total_cost) from 9 to 16
   goals met: 0 of 3
3. (move_down_fast fast0 n6 n0)
   deleted: (lift_at fast0 n6)
   added: (lift_at fast0 n0)
   changed: (total_cost) from 16 to 35
   goals met: 0 of 3
4. (board p2 slow0_0 n2 n0 n1)
   deleted: (passenger_at p2 n2) (passengers slow0_0 n0)
   added: (boarded p2 slow0_0) (passengers slow0_0 n1)
   goals met: 0 of 3
5. (move_up_slow slow0_0 n2 n6)
   deleted: (lift_at slow0_0 n2)
   added: (lift_at slow0_0 n6)
   changed: (total_cost) from 35 to 44
   goals met: 0 of 3
6. (leave p2 slow0_0 n6 n1 n0)
   deleted: (boarded p2 slow0_0) (passengers slow0_0 n1)
   added: (passenger_at p2 n6) (passengers slow0_0 n0)
   goals met: 0 of 3
7. (move_down_slow slow0_0 n6 n0)
   deleted: (lift_at slow0_0 n6)
   added: (lift_at slow0_0 n0)
   changed: (total_cost) from 44 to 55
   goals met: 0 of 3
8. (board p1 slow0_0 n0 n0 n1)
   deleted: (passenger_at p1 n0) (passengers slow0_0 n0)
   added: (boarded p1 slow0_0) (passengers slow0_0 n1)
   goals met: 0 of 3
9. (move_up_slow slow0_0 n0 n6)
   deleted: (lift_at slow0_0 n0)
   added: (lift_at slow0_0 n6)
   changed: (total_cost) from 55 to 66
   goals met: 0 of 3
10. (board p0 fast0 n0 n0 n1)
   deleted: (passenger_at p0 n0) (passengers fast0 n0)
   added: (boarded p0 fast0) (passengers fast0 n1)
   goals met: 0 of 3
11. (move_up_fast fast0 n0 n3)
   deleted: (lift_at fast0 n0)
   added: (lift_at fast0 n3)
   changed: (total_cost) from 66 to 76
   goals met: 0 of 3
12. (board p2 slow1_0 n6 n0 n1)
   deleted: (passenger_at p2 n6) (passengers slow1_0 n0)
   added: (boarded p2 slow1_0) (passengers slow1_0 n1)
   goals met: 0 of 3
13. (move_up_slow slow1_0 n6 n7)
   deleted: (lift_at slow1_0 n6)
   added: (lift_at slow1_0 n7)
   changed: (total_cost) from 76 to 82
   goals met: 0 of 3
14. (leave p2 slow1_0 n7 n1 n0)
   deleted: (boarded p2 slow1_0) (passengers slow1_0 n1)
   added: (passenger_at p2 n7) (passengers slow1_0 n0)
   goals met: 1 of 3
15. (move_down_slow slow1_0 n7 n6)
   deleted: (lift_at slow1_0 n7)
   added: (lift_at slow1_0 n6)
   changed: (total_cost) from 82 to 88
   goals met: 1 of 3
16. (leave p1 slow0_0 n6 n1 n0)
   deleted: (boarded p1 slow0_0) (passengers slow0_0 n1)
   added: (passenger_at p1 n6) (passengers slow0_0 n0)
   goals met: 1 of 3
17. (board p1 slow1_0 n6 n0 n1)
   deleted: (passenger_at p1 n6) (passengers slow1_0 n0)
   added: (boarded p1 slow1_0) (passengers slow1_0 n1)
   goals met: 1 of 3
18. (move_up_slow slow1_0 n6 n11)
   deleted: (lift_at slow1_0 n6)
   added: (lift_at slow1_0 n11)
   changed: (total_cost) from 88 to 98
   goals met: 1 of 3
19. (leave p0 fast0 n3 n1 n0)
   deleted: (boarded p0 fast0) (passengers fast0 n1)
   added: (passenger_at p0 n3) (passengers fast0 n0)
   goals met: 2 of 3
20. (leave p1 slow1_0 n11 n1 n0)
   deleted: (boarded p1 slow1_0) (passengers slow1_0 n1)
   added: (passenger_at p1 n11) (passengers slow1_0 n0)
   goals met: 3 of 3
